package Day02;

public class Q1_연산자문제 { // CLASS S
    public static void main(String[] args) { // main s



    } // main e
} // CLASS E

/*
    // 조건 : 1.변수사용불가 2.출력/연산자 만 이용한 문제
    문제1 : 국어가 30 , 영어가 70 , 수학이 80 일때 총점과 평균 구하기
    문제2 : 사다리꼴 넓이 구하기 [ 윗변 30 밑변 20 높이 10 일때 ]
        공식 : (윗변*밑변)*높이 / 2
    문제3 : 가중치가 적용된 3과목 합계 [ 중간고사 80 , 기말고사 75 , 수행평가 90 ]
        가중치 기준 : [ 중간고사 30% , 기말고사 30% , 수행평가 40% 반영 ]
    문제4 : 3753 홀수이면 '홀수' 아니면 '짝수' 출력
    문제5 : 2056 짝수이면 '짝수' 아니면 '홀수' 출력
    문제6 : 4872 7배수이면 '7배수 O' 아니면 '7배수 X' 출력
    문제7 : 7792 3배수이면 '3배수 O' 아니면 '3배수 X' 출력
    문제8 : 78 7배수 이거나 3배수 이면 '합격' 아니면 '불합격' 출력
    문제9 : 102 13배수 이면서 짝수 이면 '좌석' 아니면 '공백' 출력
    문제10 : 나이가 65세 이상이면 '노년' 50세 이상이면 '장년'
            30세 이상이면 '중년' 19세이상이면 '청년' 그외 '청소년'
            조건 : 나이가 45일때 해당하는 연령 출력
    문제11 : 356789 숫자의 금액이 존재할때 지폐 세기
        출력 예 :  십만원 3 장 ,  만원 5장 , 천원 7장 , 백원 7개
 */
