package Day04;

public class Q1_제어문 {
    public static void main(String[] args) {


    }
}

/*

    [ 삼항연산자 대신에 if ]
    문제1 : 입력받은 값이 홀수 이면 '홀수입니다' 아니면 '짝수입니다'
    문제2 : 입력받은 값이 7배수이면 '7배수입니다' 아니면 '7배수 아닙니다'
    문제3 : 국어 영어 수학 3개 점수를 입력받아
        평균이 80점이상 이면서
            국어가 90점이상이면 '[합격] 국어 우수'
            영어가 90점이상이면 '[합격] 영어 우수 '
            수학가 90점이상이면 '[합격] 수학 우수'
        평균이 70점이상이면   '합격'
        아니면  '불합격'
    문제4 : 2개의 정수를 입력받아 가장 큰수 출력
        입력 예) 3 5       출력 예 ) 3 이 가장 큽니다.
    문제5 : 3개의 정수를 입력받아 가장 큰수 출력
        입력 예) 3 5 2      출력 예 ) 5 이 가장 큽니다.
    문제6 : 4개의 정수를 입력받아 가장 큰수 출력
        입력 예) 3 5 2 8     출력 예 ) 8 이 가장 큽니다.
    문제7 : 3개의 정수를 입력받아 오름차순으로 출력
        입력 예) 3 5 2      출력 예 ) 2 3 5
    문제8 : 4개의 정수를 입력받아 내림차순 출력
        입력 예) 3 5 2 8     출력 예 ) 8 5 3 2
 */
